#ifndef __SMF_H
#define __SMF_H

#include <stdio.h>

#include <OpenImageIO/imageio.h>
#include <OpenImageIO/imagebuf.h>
#include <OpenImageIO/imagebufalgo.h>

#include <nvtt/nvtt.h>

#include "byteorder.h"
#include "nvtt_output_handler.h"

// Minimap size is defined by a DXT1 compressed 1024x1024 image with 8 mipmaps.
// 1024   + 512    + 256   + 128  + 64   + 32  + 16  + 8  + 4
// 524288 + 131072 + 32768 + 8192 + 2048 + 512 + 128 + 32 + 8 = 699048
#define MINIMAP_SIZE 699048

OIIO_NAMESPACE_USING
using namespace std;

/*
map file (.smf) layout is like this

MapHeader

ExtraHeader
ExtraHeader
...
Chunk of data pointed to by header or extra headers
Chunk of data pointed to by header or extra headers
...
*/

struct SMFHeader {
	SMFHeader();
/*  0 */	char magic[16];     // "spring map file\0"
/* 16 */	int version;        // must be 1 for now
/* 20 */	int id;             // sort of a checksum of the file
/* 24 */	int width;          // map width * 64
/* 28 */	int length;         // map length * 64
/* 32 */	int squareWidth;    // distance between vertices. must be 8
/* 36 */	int squareTexels;   // number of texels per square, must be 8 for now
/* 40 */	int tileTexels;     // number of texels in a tile, must be 32 for now
/* 44 */	float floor;        // height value that 0 in the heightmap corresponds to	
/* 48 */	float ceiling;      // height value that 0xffff in the heightmap corresponds to

/* 52 */	int heightPtr;      // file offset to elevation data (short int[(mapy+1)*(mapx+1)])
/* 56 */	int typePtr;        // file offset to typedata (unsigned char[mapy/2 * mapx/2])
/* 60 */	int tilesPtr;   // file offset to tile data (see MapTileHeader)
/* 64 */	int minimapPtr;     // file offset to minimap (always 1024*1024 dxt1 compresed data with 9 mipmap sublevels)
/* 68 */	int metalPtr;       // file offset to metalmap (unsigned char[mapx/2 * mapy/2])
/* 72 */	int featuresPtr; // file offset to feature data (see MapFeatureHeader)
	
/* 76 */	int nExtraHeaders;   // numbers of extra headers following main header
};/* 80 */

SMFHeader::SMFHeader()
:	version(1),
	squareWidth(8),
	squareTexels(8),
	tileTexels(32)
{
	strcpy(magic, "spring map file");
}

#define READPTR_SMTHEADER(mh,srcptr)                \
do {                                                \
	unsigned int __tmpdw;                           \
	float __tmpfloat;                               \
	(srcptr)->read((mh).magic,sizeof((mh).magic));  \
	(srcptr)->read(&__tmpdw,sizeof(unsigned int));  \
	(mh).version = (int)swabdword(__tmpdw);         \
	(srcptr)->read(&__tmpdw,sizeof(unsigned int));  \
	(mh).id = (int)swabdword(__tmpdw);           \
	(srcptr)->read(&__tmpdw,sizeof(unsigned int));  \
	(mh).width = (int)swabdword(__tmpdw);            \
	(srcptr)->read(&__tmpdw,sizeof(unsigned int));  \
	(mh).length = (int)swabdword(__tmpdw);            \
	(srcptr)->read(&__tmpdw,sizeof(unsigned int));  \
	(mh).squareWidth = (int)swabdword(__tmpdw);      \
